puts 1 + 2

puts 1.0 + 2.0
puts 2.0 * 3.0
puts 5.0 - 8.0
puts 9.0 / 2.0

#次の結果を表示するプログラムを書いてみましょう。

puts "1年は何時間でしょうか？"
puts 365 * 24
#1年= 365日 * 24時間 

puts "10年間は何分でしょうか？"
puts (60 * 24 * 365) * 10 
#1日の分数 * 1年の日数 * 10年

puts "あなたが生まれてから今日まで何秒たっているでしょうか?"
puts (60 * 60 * 24) * (42 * 365) + (60 * 60 * 24) * (8 * 30) + (60 * 60 * 24) * 17  
#42年＋8ヶ月＋17日　

puts "あなたは一生のうちいくつのチョコレートを食べたいですか? 注:この計算には多少時間がかかるかもしれません。"
puts 365 * 80

puts "次は、もう少し難しい質問です。私が生まれてから10億3400万秒 たっているとしたら、私は今何歳でしょう?"
puts 1034000000 / 60 / 60 / 24 / 365
#10億3400万秒/60秒/60分/24時間/365日